Revit 2021.1 API
FabricationServiceButton Properties
The FabricationServiceButton type exposes the following members.
Properties
Name | Description
ButtonIndex
 The button index for this button.
Code
 The code of the button.
ConditionCount
 The number of conditions.
GroupIndex
 The group index for this button.
IsAHanger
 Checks if the fabrication service button is hanger.
IsStraight
 Checks if all of the fabrication service button conditions are straights.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the button.
ServiceId
 The fabrication service identifier for the fabrication service this button belongs to.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace